week4/w4d1/art_share_api/app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    # render plain: "I'm in the index action!"
    @users = User.all

INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Jesse"], ["email", "jesse@gmail.com"], ["created_at", "2017-08-22 03:21:39.914439"], ["updated_at", "2017-08-22 03:21:39.914439"]]
---
  def create
    user = User.new(user_params)
    # user = User.new(params.require(:user).permit(:name, :email))
    if user.save